<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="10" name="x" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="phones">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="x_lengths" type="Parameter" version="opset1">
			<data shape="1" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="phones_length">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sid" type="Parameter" version="opset1">
			<data shape="1" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="speakers">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="tone" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="tones">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="language" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="lang_ids">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="bert" type="Parameter" version="opset1">
			<data shape="1,1024,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="bert">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ja_bert" type="Parameter" version="opset1">
			<data shape="1,768,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="ja_bert">
					<dim>1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="noise_scale" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="noise_scale">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="length_scale" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="length_scale">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="noise_scale_w" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="noise_scale_w">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="sdp_ratio" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="sdp_ratio">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.model/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="__module.model.enc_p/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="13" name="self.model.enc_p.emb.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 192" offset="4" size="43008" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.emb.weight">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="self.model.enc_p.emb.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.enc_p.emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.enc_p.emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="17" name="__module.model.enc_p.emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>112</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="104">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.enc_p.tone_emb.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="11, 192" offset="43012" size="4224" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.tone_emb.weight">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="self.model.enc_p.tone_emb.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.enc_p.tone_emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.enc_p.tone_emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="22" name="__module.model.enc_p.tone_emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>11</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="106">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.model.enc_p/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="107">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.enc_p.language_emb.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 192" offset="47236" size="1536" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.language_emb.weight">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="self.model.enc_p.language_emb.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.enc_p.language_emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.enc_p.language_emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="28" name="__module.model.enc_p.language_emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="109">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.enc_p/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="110">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="self.model.enc_p.bert_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1024, 1" offset="48772" size="393216" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.bert_proj.weight">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="self.model.enc_p.bert_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.enc_p.bert_proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.enc_p.bert_proj/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1" offset="441988" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.enc_p.bert_proj/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.enc_p.bert_proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="93">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.enc_p/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="442372" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.enc_p/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="94,bert_emb">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.enc_p/aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="111">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="self.model.enc_p.ja_bert_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 768, 1" offset="442384" size="294912" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.ja_bert_proj.weight">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="self.model.enc_p.ja_bert_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1" offset="737296" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="101">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.enc_p/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="442372" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.enc_p/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="102,ja_bert_emb">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.enc_p/aten::add/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="112">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_658471_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="737680" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_658471" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.enc_p/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="113">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.enc_p/aten::transpose/ScatterElementsUpdate_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="442372" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.enc_p/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="114,x.3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="ShapeOf_682952" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_682953" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737682" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="55" name="Constant_682954" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737690" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="56" name="Gather_682955" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="115" />
			</output>
		</layer>
		<layer id="57" name="__module.model.enc_p/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="737698" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="58" name="__module.model.enc_p/aten::arange/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="116,x.5">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="47" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737690" size="8" />
			<output>
				<port id="0" precision="I64" names="47" />
			</output>
		</layer>
		<layer id="60" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="117">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="48" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737702" size="8" />
			<output>
				<port id="0" precision="I64" names="48" />
			</output>
		</layer>
		<layer id="62" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="118">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.enc_p/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="119">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="120">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.enc_p/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="121,1301,x_mask.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="49" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737682" size="8" />
			<output>
				<port id="0" precision="I64" names="49" />
			</output>
		</layer>
		<layer id="67" name="__module.model.enc_p.encoder/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="172,2392">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="69" name="__module.model.enc_p/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122,x.7">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.enc_p.encoder/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="175,x.17">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="69" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737710" size="8" />
			<output>
				<port id="0" precision="I64" names="69" />
			</output>
		</layer>
		<layer id="72" name="__module.model.enc_p.encoder/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="173">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.enc_p.encoder/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="174,mask.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_658472_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="737718" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_658472" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.enc_p.encoder.attn_layers.0/aten::eq/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="1007,1191,264,448,639,823">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.enc_p.encoder.attn_layers.0/aten::masked_fill/ConvertLike_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="737720" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="78" name="__module.model.enc_p.encoder.attn_layers.0/aten::masked_fill/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 192, 1" offset="737722" size="73728" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.encoder.attn_layers.0.conv_q.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1" offset="811450" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188,query.1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_683603" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="811834" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.enc_p.encoder.attn_layers.0/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.enc_p.encoder.attn_layers.0/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="811866" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.enc_p.encoder.attn_layers.0/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="210,query.3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_658473_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="811882" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_658473" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217,231">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 192, 1" offset="811884" size="73728" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.encoder.attn_layers.0.conv_k.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1" offset="885612" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="195,key.1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_683604" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="811834" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.enc_p.encoder.attn_layers.0/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212,218">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.enc_p.encoder.attn_layers.0/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="219,scores.1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.model.enc_p.encoder.attn_layers.0.emb_rel_k_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 9, 96" offset="885996" size="1728" />
			<output>
				<port id="0" precision="FP16" names="self.model.enc_p.encoder.attn_layers.0.emb_rel_k">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="self.model.enc_p.encoder.attn_layers.0.emb_rel_k" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Unsqueeze_183048" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="737690" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="ShapeOf_682957" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_682968" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737682" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="106" name="Constant_682969" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737690" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="107" name="Gather_682970" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="205" />
			</output>
		</layer>
		<layer id="108" name="Constant_183047" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="109" name="Unsqueeze_682698" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_682700" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="887724" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.enc_p.encoder.attn_layers.0/aten::sub/Subtract" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="220,221,222,294,295,296,pad_length.1,pad_length.3">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Concat_183054" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
				<port id="5" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad/Range" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="887732" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_183063" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="115" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad/Range_4" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="887744" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_183081" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="118" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad/ConvertLike_11_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="737718" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="120" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad/ConvertLike_11" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="121" name="__module.model.enc_p.encoder.attn_layers.0/aten::pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="228,229,padded_relative_embeddings.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.enc_p.encoder.attn_layers.0/aten::slice/Reshape_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="737690" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_10480" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737682" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="62" />
			</output>
		</layer>
		<layer id="124" name="__module.model.enc_p.encoder.attn_layers.0/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="223,224,297,298" />
			</output>
		</layer>
		<layer id="125" name="Constant_656187" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="737710" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="126" name="__module.model.enc_p.encoder.attn_layers.0/aten::sub/Subtract_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="225,226,299,300,slice_end_position.1,slice_end_position.3" />
			</output>
		</layer>
		<layer id="127" name="Constant_745464" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="737710" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.enc_p.encoder.attn_layers.0/aten::slice/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.model.enc_p.encoder.attn_layers.0/aten::slice/Reshape_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="737702" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="__module.model.enc_p.encoder.attn_layers.0/aten::slice/Reshape_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="737702" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
